---
kind: method
id: M:Autodesk.Revit.Attributes.RegenerationAttribute.#ctor(Autodesk.Revit.Attributes.RegenerationOption)
source: html/35b84faa-4316-fa08-ba68-f07e485ee550.htm
---
# Autodesk.Revit.Attributes.RegenerationAttribute.#ctor Method

Constructs a new RegenerationAttribute.

## Syntax (C#)
```csharp
public RegenerationAttribute(
	RegenerationOption option
)
```

## Parameters
- **option** (`Autodesk.Revit.Attributes.RegenerationOption`)